Revit 2025 API
ViewDuplicateOption Enumeration
 Options for duplicating views
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ViewDuplicateOption
Public Enumeration ViewDuplicateOption
public enum class ViewDuplicateOption
type ViewDuplicateOption
Members
Member name | Value | Description
Duplicate | 0 |  Duplicate view
AsDependent | 1 |  Duplicate as Dependent
WithDetailing | 2 |  Duplicate with Detailing
See Also
Reference
Autodesk.Revit.DB Namespace